kiffie/pic32-pac/pic32mx2xx/pic32mx1xxfxxxc/PIC32MX150F128C.svd
        <register>
          <name>IPC0</name>
          <description>IPC0 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0CLR</name>
          <description>IPC0CLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0SET</name>
          <description>IPC0SET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0INV</name>
          <description>IPC0INV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1</name>
          <description>IPC1 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1CLR</name>
          <description>IPC1CLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1SET</name>
          <description>IPC1SET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1INV</name>
          <description>IPC1INV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2</name>
          <description>IPC2 register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2CLR</name>
          <description>IPC2CLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2SET</name>
          <description>IPC2SET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2INV</name>
          <description>IPC2INV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3</name>
          <description>IPC3 register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3CLR</name>
          <description>IPC3CLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3SET</name>
          <description>IPC3SET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3INV</name>
          <description>IPC3INV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4</name>
          <description>IPC4 register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4CLR</name>
          <description>IPC4CLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4SET</name>
          <description>IPC4SET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T4IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
