kiffie/pic32-pac/pic32mx2xx/pic32mx1xxfxxxc/PIC32MX150F128C.svd
      </registers>
      <interrupt>
        <name>CORE_TIMER</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>CORE_SOFTWARE_0</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>CORE_SOFTWARE_1</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_0</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>TIMER_1</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_1</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_1</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_1</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>TIMER_2</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_2</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_2</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_2</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>TIMER_3</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_3</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_3</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_3</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>TIMER_4</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_4</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_4</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_4</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>TIMER_5</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_5</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_5</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>FAIL_SAFE_MONITOR</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>RTCC</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>FCE</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>COMPARATOR_1</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>COMPARATOR_2</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>COMPARATOR_3</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>SPI_1</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>UART_1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>I2C_1</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>PMP</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>SPI_2</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>UART_2</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>I2C_2</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>CTMU</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>DMA_0</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>DMA_1</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>DMA_2</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>DMA_3</name>
        <value>43</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>BMX</name>
      <description>BMX peripheral</description>
      <baseAddress>0xbf882000</baseAddress>
      <registers>
        <register>
          <name>BMXCON</name>
          <description>BMXCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>2031681</resetValue>
          <fields>
            <field>
              <name>BMXARB</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>BMXWSDRM</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BMXERRIS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BMXERRDS</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BMXERRDMA</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BMXERRICD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BMXERRIXI</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BMXCHEDMA</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXCONCLR</name>
          <description>BMXCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXARB</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>BMXWSDRM</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BMXERRIS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BMXERRDS</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BMXERRDMA</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BMXERRICD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BMXERRIXI</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BMXCHEDMA</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXCONSET</name>
          <description>BMXCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXARB</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>BMXWSDRM</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BMXERRIS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BMXERRDS</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BMXERRDMA</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BMXERRICD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BMXERRIXI</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BMXCHEDMA</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXCONINV</name>
          <description>BMXCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXARB</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>BMXWSDRM</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BMXERRIS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BMXERRDS</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BMXERRDMA</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BMXERRICD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BMXERRIXI</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BMXCHEDMA</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDKPBA</name>
          <description>BMXDKPBA register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDKPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDKPBACLR</name>
          <description>BMXDKPBACLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDKPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDKPBASET</name>
          <description>BMXDKPBASET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDKPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDKPBAINV</name>
          <description>BMXDKPBAINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDKPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDUDBA</name>
          <description>BMXDUDBA register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDUDBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDUDBACLR</name>
          <description>BMXDUDBACLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDUDBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDUDBASET</name>
          <description>BMXDUDBASET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDUDBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDUDBAINV</name>
          <description>BMXDUDBAINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDUDBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDUPBA</name>
          <description>BMXDUPBA register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDUPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDUPBACLR</name>
          <description>BMXDUPBACLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDUPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDUPBASET</name>
          <description>BMXDUPBASET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDUPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDUPBAINV</name>
          <description>BMXDUPBAINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXDUPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXDRMSZ</name>
          <description>BMXDRMSZ register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>131072</resetValue>
          <fields>
            <field>
              <name>BMXDRMSZ</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXPUPBA</name>
          <description>BMXPUPBA register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXPUPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXPUPBACLR</name>
          <description>BMXPUPBACLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXPUPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXPUPBASET</name>
          <description>BMXPUPBASET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXPUPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXPUPBAINV</name>
          <description>BMXPUPBAINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BMXPUPBA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXPFMSZ</name>
          <description>BMXPFMSZ register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>524288</resetValue>
          <fields>
            <field>
              <name>BMXPFMSZ</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BMXBOOTSZ</name>
          <description>BMXBOOTSZ register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>12288</resetValue>
          <fields>
            <field>
              <name>BMXBOOTSZ</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
