kiffie/pic32-pac/pic32mx2xx/pic32mx1xxfxxxc/PIC32MX150F128C.svd
        <register>
          <name>CNENCINV</name>
          <description>CNENCINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATC</name>
          <description>CNSTATC register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCCLR</name>
          <description>CNSTATCCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCSET</name>
          <description>CNSTATCSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATCINV</name>
          <description>CNSTATCINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>